examples/Marathon_test/0.orig/Fg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Finit          (0.0 0.0 0.0); 

dimensions      [1 -2 -2 0 0 0 0];

internalField    uniform $Finit;

boundaryField
{
    
   "(north|south|east|west|top|bottom|terrain)"
    {
        type           zeroGradient;      
    }

   tank1
    {
        type            zeroGradient;
    }


}
// ************************************************************************* //
