examples/Marathon_test/0.orig/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(north|south|east|west)"
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    "(bottom|terrain)"
    {
        type            zeroGradient;
    }

    tank1
    {
       // type            fixedValue;
       // value           uniform 0.0993;
        type            zeroGradient;
    }



    default
    {
        type            zeroGradient;
    }
  
}


// ************************************************************************* //
