examples/Marathon_test/system/mapFieldsDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      mapFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patchMap        ();

cuttingPatches  ();


