examples/Marathon_test/system/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
     //   source  cylinderToCell;
     //   p1 (5343.3 2700.7 -1);
     //   p2 (5343.3 2700.7 1);
     //   radius 800;
        source  boxToCell;        
        box (4600.0 2100.0 -1) (6000.0 3100 1000);
    }
);

// ************************************************************************* //
//  5343.3 2700.7 //
